# tap
#tap "homebrew/core"
#tap "homebrew/cask"
tap "aquasecurity/trivy"
tap "aws/tap"
tap "benwebber/tunnelblickctl"
tap "fujiwara/tap"
tap "genkiroid/cert"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koluku/tap"
tap "k1low/tap"
tap "minamijoyo/tfupdate"
tap "rhysd/actionlint", "https://github.com/rhysd/actionlint"
tap "sanemat/font"
tap "sqldef/sqldef"
tap "stateful/tap"
tap "uzimaru0000/tap"
tap "yukiarrr/tap"

# brew
brew "ack"
brew "alp"
brew "xz"
brew "python@3.10", link: false
brew "ansible"
brew "anyenv"
brew "libpng"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "argocd"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bzip2"
brew "fontconfig"
brew "gcc"
brew "glib"
brew "python@3.9"
brew "cfn-lint"
brew "colordiff"
brew "coreutils"
brew "csvq"
brew "openldap"
brew "curl"
brew "exa"
brew "dbdeployer"
brew "direnv"
brew "docker", link: false
brew "docker-compose", link: false
brew "docker-slim"
brew "duf"
brew "findutils"
brew "fish"
brew "harfbuzz"
brew "hadolint"
brew "pango"
brew "fontforge"
brew "fzf"
brew "gdk-pixbuf"
brew "gdrive"
brew "gh"
brew "ghq"
brew "git"
brew "git-secrets"
brew "gitleaks"
brew "gitup"
brew "guile"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "jasper"
brew "jpeg", link: true
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gron"
brew "hadolint"
brew "hey"
brew "htop"
brew "hub"
brew "infracost"
brew "jc"
brew "jq"
brew "keychain"
brew "kind"
brew "kubernetes-cli"
brew "lambroll"
brew "lazygit"
brew "libedit"
brew "libiconv"
brew "libslirp"
brew "libxml2"
brew "qemu"
brew "lima"
brew "macvim"
brew "mas"
brew "mcrypt"
brew "minikube"
brew "mkcert"
brew "mysql"
brew "mysqldef"
brew "psqldef"
brew "neovim"
brew "nghttp2"
brew "nkf"
brew "nmap"
brew "node"
brew "packer"
brew "pcre"
brew "peco"
brew "perl"
brew "pipx"
brew "podman"
brew "pre-commit"
brew "pulumi"
brew "pwgen"
brew "python@3.8"
brew "rain"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sbt"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "sshuttle"
brew "sslscan"
brew "stern"
brew "s3s"
brew "terraform-docs"
brew "terraform-ls"
brew "terraformer"
brew "terraforming"
brew "terragrunt"
brew "textql"
#brew "tflint"
brew "tfmigrate"
brew "tfsec"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "wireshark"
brew "yq"
brew "z"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "aquasecurity/trivy/trivy"
brew "aws/tap/aws-sam-cli"
brew "aws/tap/copilot-cli"
brew "benwebber/tunnelblickctl/tunnelblickctl"
brew "fujiwara/tap/ecsta"
brew "fujiwara/tap/tracer"
brew "genkiroid/cert/cert"
brew "k1low/tap/tbls"
brew "minamijoyo/tfupdate/tfupdate"
brew "rhysd/actionlint/actionlint"
brew "sanemat/font/ricty", args: ["with-powerline"]
brew "stateful/tap/rdme"
brew "uzimaru0000/tap/tv"
brew "yukiarrr/tap/ecsk"

# cask
cask "1password6"
cask "accessmenubarapps"
cask "alacritty"
cask "alfred3"
cask "atom"
cask "authy"
cask "biscuit"
cask "brewlet"
cask "clipy"
cask "cyberduck"
cask "dbeaver-community"
cask "devtoys"
cask "discord"
cask "docker"
cask "dropbox"
cask "evernote"
cask "finch"
cask "firefox"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "hyperswitch"
cask "iterm2"
cask "karabiner-elements"
cask "libreoffice"
cask "libreoffice-language-pack", args: { language: "ja" }
cask "ngrok"
cask "notion"
cask "obsidian"
cask "polar-bookshelf"
cask "powershell"
cask "scroll-reverser"
cask "sequel-ace"
cask "sequel-pro"
cask "skim"
cask "slack"
cask "sublime-text"
cask "tableplus"
cask "the-unarchiver"
cask "tunnelblick"
cask "typora"
cask "vagrant"
#cask "virtualbox"
cask "visual-studio-code"
cask "zoom"

# mas
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973

